app/controllers/pages_controller.rb

  def profile
    if(User.find_by_username(params[:id]))
      @username = params[:id]
    else
      redirect_to root_path, :notice => "User not found!"
    end

    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Jack"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 4) ORDER BY "posts"."created_at" DESC